INSERT INTO students (name, kana_name, nick_name, email, area, age, gender, remark, is_deleted)
VALUES
('円堂守', 'エンドウマモル', 'マモル', 'mamoru.endo@gmail.com', '東京', 15, '男性', 'サッカー大好き', FALSE),
('越前リョーマ', 'エチゼンリョーマ', 'リョーマ', 'ryoma.echizen@gmail.com', '東京', 13, '男性', NULL, FALSE),
('桜木花道', 'サクラギハナミチ', 'ハナミチ', 'hanamichi.sakuragi@gmail.com', '神奈川', 15, '男性', NULL, FALSE),
('日向翔陽', 'ヒナタショウヨウ', 'ショーヨー', 'shoyo.hinata@gmail.com', '宮城', 15, '男性', NULL, FALSE),
('茂野吾郎', 'シゲノゴロウ', 'ゴロー', 'goro.shigeno@gmail.com', '神奈川', 18, '男性', NULL, FALSE),
('村井', 'ムライ', 'ムラ', 'murai.@gmail.com', '大阪', 69, '男性', '寝坊', FALSE),
('水野', 'ミズノ', 'ミーミー', 'mizuno.@gamil.com', '秋田', 8, '男性', '早起き', FALSE),
('キャサリン', 'キャサリン', 'キャッシー', 'kyasarin.@gmail.com', 'アメリカ', 60, '女性', '外国人', FALSE),
('トーマス', 'トーマス', 'マソ', 'tomasu@gmail.com', 'オーストラリア', 22, '男性', '', FALSE),
('美舞', 'ミマイ', 'マイマイ', 'mimai@gmail.com', '岡山', 27, '女性', '', FALSE),
('戸田', 'トダ', 'トダダダ', 'toda@gmail.com', '青森', 36, '男性', '', FALSE),
('角刈り', 'カクガリ', 'ソリアゲ', 'kakugari@gmail.com', '愛媛', 17, '男性', '', FALSE),
('角刈り', 'カクガリ', 'ソリアゲ', 'kakugari@gmail.com', '愛媛', 17, '男性', '', FALSE),
('角刈り', 'カクガリ', 'ソリアゲ', 'kakugari@gmail.com', '愛媛', 17, '男性', '', FALSE);

INSERT INTO students_courses (student_id, course_name, course_start, course_end)
VALUES
(1, 'サッカー',       '2025-04-01 09:00:00', '2025-07-01 09:00:00'),
(2, 'テニス',         '2025-04-10 10:00:00', '2025-08-10 10:00:00'),
(3, 'バスケ',         '2025-05-01 09:00:00', '2025-09-01 09:00:00'),
(4, 'バレー',         '2025-06-01 09:00:00', '2025-09-30 09:00:00'),
(5, '野球',           '2025-03-01 09:00:00', '2025-07-01 09:00:00'),
(6, '麻雀',          '2025-11-02 20:16:36', '2026-11-02 20:16:36'),
(7, '空手',          '2025-11-04 11:14:48', '2026-11-04 11:14:48'),
(8, 'コミック',     '2025-11-04 12:39:27', '2026-11-04 12:39:27'),
(9, '日本語コース', '2025-11-11 11:03:19', '2026-11-11 11:03:19'),
(10, '洋楽コース',   '2025-11-11 11:09:33', '2026-11-11 11:09:33'),
(11, '和菓子コース', '2025-11-11 14:10:56', '2026-11-11 14:10:56'),
(12, '散髪コース',   '2025-11-14 12:03:08', '2026-11-14 12:03:08'),
(13, '散髪コース',   '2025-11-14 14:19:05', '2026-11-14 14:19:05'),
(14, '散髪コース',   '2025-11-16 09:32:19', '2026-11-16 09:32:19');

INSERT INTO course_status (student_course_id, status) VALUES
(1, '仮申し込み'),
(2, '本申し込み'),
(3, '本申し込み'),
(4, '本申し込み'),
(5, '本申し込み'),
(6, '受講中'),
(7, '受講中'),
(8, '受講中'),
(9, '受講中'),
(10, '受講中'),
(11, '受講終了'),
(12, '受講終了'),
(13, '受講終了'),
(14, '受講終了');

